---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctSettings.SetUpFromBottom
source: html/45e7e748-e45b-1d98-04db-ea9a48314163.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.SetUpFromBottom Property

The abbreviation of the Set Up from bottom (BU) of fitting string.

## Syntax (C#)
```csharp
public string SetUpFromBottom { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null